Revit 2026 API

# DocumentVersion Properties

---

The DocumentVersion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfSaves | The number of times the document has been saved. The save number and GUID are both necessary to uniquely identify a document version. |
|  | VersionGUID | The GUID portion of the DocumentVersion. The GUID is updated when changes are made to the document, but may not update with every change to the document. The GUID and save number are both necessary to uniquely identify a document version. |

#### Reference

DocumentVersion Class

Autodesk.Revit.DB Namespace